{
  "description" : "The Cairn terrier is a small-sized, sturdy dog with short legs. It has a flat head, a pronounced stop, \"\n            \"a strong muzzle and a black nose. \\n\"\n            \"The eyes are wide apart, hazel and covered with bushy eyebrows. \\n\"\n            \"The ears are small, triangular, slightly slating, pointy and erect. \\n\"\n            \"The tail is short, pointy at the tip covered in hair and carried vertically. \\n\"\n            \"The fur is double-layered, with soft and fluffy inner layer and an outer layer made of thick, rough, \"\n            \"not too short, straight hair. \\n\"\n            \"The coat can have any colour except white and has darker shades on the ears, muzzle and the tip of the \"\n            \"tail.\")\n\n\ndef personality():\n    return (\"It is a lively, very happy, playful, alert, brave, intelligent, watchful dog. \\n\"\n            \"It is affectionate and devoted to its master. It is loving and tolerant with children and is not \"\n            \"aggressive with strangers. \\n\"\n            \"It gets along well with other household animals, even with other dogs, with some exceptions.\")\n\n\ndef grooming():\n    return \"This dog's fur must be brushed regularly and trimmed 2-3 times a year.\"\n\n\ndef living_conditions():\n    return (\"It is a dog that can adapt rather easily both to outdoor life, being resistant to weather changes and \"\n            \"to life in a flat with an active family and with the possibility of exercising and getting daily walks. \\n\"\n            \"It needs socialization and training.\")\n\n\ndef training():\n    return (\"This dog is relatively easy to train because it is intelligent, likes to learn and to work. \\n\"\n            \"It needs a rigorous, firm, consistent training done in a gentle and calm voice and it shouldn't be let to do what it wants. \\n\"\n            \"It should be socialized from an early age with other household animals and other dogs. \\n\"\n            \"It likes exercise and running in open spaces. It must be taught to come to its master when called, \"\n            \"because of its hunting instincts that can make it run away.\")\n\n\ndef usefulness():\n    return \"It is a very good hunter of rodents and small wild animals. It is a perfect companion for a sportive family.\"\n",
  "personality" : "It is a lively, very happy, playful, alert, brave, intelligent, watchful dog. \n It is affectionate and devoted to its master. It is loving and tolerant with children and is not aggressive with strangers. \nIt gets along well with other household animals, even with other dogs, with some exceptions."
  "grooming" : "This dog's fur must be brushed regularly and trimmed 2-3 times a year."
  "living situations" : "It is a dog that can adapt rather easily both to outdoor life, being resistant to weather changes and to life in a flat with an active family and with the possibility of exercising and getting daily walks. \n It needs socialization and training.")
  "training" : "This dog is relatively easy to train because it is intelligent, likes to learn and to work. \n It needs a rigorous, firm, consistent training done in a gentle and calm voice and it shouldn't be let to do what it wants. \n It should be socialized from an early age with other household animals and other dogs. \n It likes exercise and running in open spaces. It must be taught to come to its master when called because of its hunting instincts that can make it run away.")
  "usefulness" : "It is a very good hunter of rodents and small wild animals. It is a perfect companion for a sportive family."

}